app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT * FROM "articles"

  def show
    @article = Article.find(params[:id])
    @categories = Category.find(:all)
---
SELECT * FROM "articles" WHERE ("articles".category_id = 4)
SELECT * FROM "categories" WHERE ("categories"."id" = 4)

  def edit
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def create
    @article = Article.new(params[:article])
    @article.category = Category.find(params[:category][:id])

    respond_to do |format|
      if @article.save
---
SELECT * FROM "categories" WHERE ("categories"."id" = 4)
INSERT INTO "articles" ("created_at", "title", "author", "body", "updated_at", "category_id") VALUES('2010-03-16 16:18:51', 'Beut', 'Mark Fayngersh', 'Its all about the beut!', '2010-03-16 16:18:51', NULL)

  def update
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT * FROM "articles" WHERE ("articles"."id" = 2)
DELETE FROM "articles" WHERE "id" = 2