app/controllers/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT * FROM "categories"

  def show
    @categories = Category.all
    @category = Category.find(params[:id])
---
SELECT * FROM "categories"
SELECT * FROM "categories" WHERE ("categories"."id" = 1)

  def edit
    @category = Category.find(params[:id])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 4)

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "title", "updated_at") VALUES('2010-03-16 16:14:55', 'News', '2010-03-16 16:14:55')

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT * FROM "categories" WHERE ("categories"."id" = 3)
DELETE FROM "categories" WHERE "id" = 3